bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Utilities/Third_Party/mbedtls-2.17.0/library/bignum.c
    if( verbose != 0 )
        mbedtls_printf( "passed\n" );

cleanup:

    if( ret != 0 && verbose != 0 )
        mbedtls_printf( "Unexpected error, return code = %08X\n", ret );

    mbedtls_mpi_free( &A ); mbedtls_mpi_free( &E ); mbedtls_mpi_free( &N ); mbedtls_mpi_free( &X );
    mbedtls_mpi_free( &Y ); mbedtls_mpi_free( &U ); mbedtls_mpi_free( &V );

    if( verbose != 0 )
        mbedtls_printf( "\n" );

    return( ret );
}

#ifdef CONFIG_HW_SECURITY_ENGINE
#define DATA_LENGTH    16
#define DATA_LENGTH_1024    32
const uint32_t DIN_M_1024[DATA_LENGTH_1024] = {0x5884d1a0, 0xCAD23435, 0x511c06ff, 0xc06f0b56, 0x30220837, 0x359fa0a6, 0x36e403ec, 0x305f361c,
                            0xe5027eaa, 0xf5bce8ac, 0xfb24549b, 0x17107865, 0x1824daab, 0xc59ffade, 0x6bcf71eb, 0x9fc6be97,
                            0x0168c993, 0xd436a0e4, 0x635486e6, 0x602ef418, 0x4f7b1bbe, 0xee52df5c, 0x165e3058, 0x85edfb11,
                            0x6a3af995, 0x385b88bd, 0x42c20249, 0x2f4406f5, 0x7f763d49, 0x01348df6, 0x9a2d611e, 0x8e0bef74};

const uint32_t DIN_N_1024[DATA_LENGTH_1024] = {0xe9bf8549, 0x16d8ba65, 0x25f213f8, 0xe505f953, 0x67db31e1, 0x945a19db, 0x4f139c7c, 0x17f974ca,
                            0x5dcb6c9a, 0x43abcd85, 0x18b23167, 0x4e1788b7, 0xbe7d7d51, 0xd6e891c4, 0xc5853890, 0x197372b4,
                            0x114ad23c, 0x9edfe8c2, 0xfec830b3, 0x45472f87, 0x271b6693, 0xe8a24392, 0xc41fb462, 0x19f906f3,
                            0x687e80ba, 0xb2f0e540, 0x26954c0e, 0x3f3a1d9d, 0x81585acb, 0xb7b666d7, 0x3d3c5691, 0xb0607d89};

const uint32_t DIN_E_1024[DATA_LENGTH_1024] = {0x6a3921ab, 0xc1cc96fe, 0xc84d342f, 0xf9c0b12d, 0x09c1f7f8, 0x6137dcf5, 0xe9a9c38e, 0xc654f73e,
                            0x2c64bff9, 0x78edc66e, 0xfbc2a446, 0xbf336a12, 0x260e17d6, 0x5c3e1e2e, 0xd685ff19, 0x3ebe219b,
                            0x9d70b03d, 0xa35e98a8, 0xf9b1f0c2, 0x35b88715, 0xff012353, 0xd4010658, 0xf08f42ff, 0x8d14f341,
                            0x6971528b, 0x3a63e740, 0x043a4ae3, 0xc7507145, 0x7272a128, 0x2d560ec6, 0x5152d088, 0x499d46cf};

const uint32_t DIN_C_1024[DATA_LENGTH_1024] = {0x428b5d3b, 0x680eb1be, 0xe3386abe, 0x6895b9e6, 0x7ebb66a4, 0xe5087aee, 0x77a8f598, 0xaff76a2b,
                            0xcff059fb, 0x3e1bb5fd, 0xca129b90, 0x70082b8a, 0xc9fe365a, 0x9282d34e, 0xdf64e694, 0xa83cd527,
                            0x2a3f3b81, 0x93001d2a, 0x8028cc7d, 0x3cec5f3f, 0xdf818b4a, 0x4a6d1408, 0xcd8564c9, 0x8b3f2511,
                            0xdf617ac9, 0x35c0ba97, 0x7201b5ef, 0x9e3e8384, 0xfae0e7f0, 0xaa7ea82b, 0xbc539cc5, 0x2bf27be9};

const uint32_t RSA_W0_1024 = 0x99178307;
const uint32_t RSA_W1_1024 = 0x298bc7dc;

const uint32_t DIN_M[DATA_LENGTH] = {0x00000287, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,
                            0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000};

const uint32_t DIN_N[DATA_LENGTH] = {0x000003E5, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,
                            0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000};

const uint32_t DIN_E[DATA_LENGTH] = {0x000002E7, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,
                            0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000};

const uint32_t DIN_C[DATA_LENGTH] = {0x000000b9, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,
                            0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000};

const uint32_t RSA_W0 = 0xCE717E13;
const uint32_t RSA_W1 = 0x5C6FF3AC;

const uint32_t Expected512[DATA_LENGTH] = {0x000000ae, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000,
                            0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000};

const uint32_t Expected1024[DATA_LENGTH_1024] =
                    {0xeab582dd, 0x72b641c8, 0x9923f874, 0xe6979fbf, 0xa8549c4b, 0xcfeb1b21, 0x9e74153c, 0x87d83c72,
                     0xf7964d37, 0x161593f1, 0x5553303e, 0xf8c41372, 0x1e37f9e5, 0x327855b6, 0xfd72fec7, 0x088f84e1,
                     0x5c477240, 0x69fb0dfc, 0x7a59cf64, 0x3f42d882, 0x2c6e049a, 0x3842f987, 0xa3b43198, 0x55b54d4e,
                     0x0bb81ba5, 0x44dbcd1e, 0x2eaedc6b, 0xf976a75c, 0x1b052d11, 0xd2fc0938, 0xb48a7f26, 0x091b98cb};

int mbedtls_mpi_exp_mod_self_test_512( int verbose )
{
    mbedtls_mpi M, E, N;
    int ret = 0;

    /*********************** RSA 512 *****************************/
    if(verbose)
        mbedtls_printf( "  MPI test #6 (exp mod 512): \n" );

    mbedtls_mpi_init( &M ); mbedtls_mpi_init( &E ); mbedtls_mpi_init( &N );

    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &M, 16,
        "00000000000000000000000000000000" \
        "00000000000000000000000000000000" \
        "00000000000000000000000000000000" \
        "00000000000000000000000000000287" ) );

    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &N, 16,
     	"00000000000000000000000000000000" \
     	"00000000000000000000000000000000" \
     	"00000000000000000000000000000000" \
     	"000000000000000000000000000003E5" ) );

    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &E, 16,
    	"00000000000000000000000000000000" \
    	"00000000000000000000000000000000" \
    	"00000000000000000000000000000000" \
    	"000000000000000000000000000002E7" ) );

    mbedtls_mpi_exp_mod( &M, &M, &E, &N, NULL);

    if (memcmp(M.p, Expected512, DATA_LENGTH * 4) == 0) {
	    if(verbose)
            mbedtls_printf( "Pass ^_^ \n" );
    } else {
        if(verbose){
            mbedtls_printf( "Fail\n" );
            MPI_PRINT(1, "M: ", &M);
        }
		ret ++;
    }

cleanup:

    mbedtls_mpi_free( &M );
    mbedtls_mpi_free( &E );
    mbedtls_mpi_free( &N );

    return ret;
}

