bender2333/x-protocal/Third_Party/GD32F/gd32-secure-boot-secure-firmware-update/Utilities/Third_Party/mbedtls-2.17.0/library/bignum.c
int mbedtls_mpi_exp_mod_self_test_1024( int verbose )
{
    mbedtls_mpi M, E, N;
    int ret = 0;

    /*********************** RSA 1024 *****************************/
    if(verbose)
        mbedtls_printf( "  MPI test #7 (exp mod 1024): \n" );

    mbedtls_mpi_init( &M ); mbedtls_mpi_init( &E ); mbedtls_mpi_init( &N );
    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &M, 16,
    	"8e0bef749a2d611e01348df67f763d49" \
    	"2f4406f542c20249385b88bd6a3af995" \
    	"85edfb11165e3058ee52df5c4f7b1bbe" \
    	"602ef418635486e6d436a0e40168c993" \
    	"9fc6be976bcf71ebc59ffade1824daab" \
    	"17107865fb24549bf5bce8ace5027eaa" \
    	"305f361c36e403ec359fa0a630220837" \
    	"c06f0b56511c06ffCAD234355884d1a0" ) );
    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &N, 16,
    	"b0607d893d3c5691b7b666d781585acb" \
    	"3f3a1d9d26954c0eb2f0e540687e80ba" \
    	"19f906f3c41fb462e8a24392271b6693" \
    	"45472f87fec830b39edfe8c2114ad23c" \
    	"197372b4c5853890d6e891c4be7d7d51" \
    	"4e1788b718b2316743abcd855dcb6c9a" \
    	"17f974ca4f139c7c945a19db67db31e1" \
    	"e505f95325f213f816d8ba65e9bf8549" ) );

    MBEDTLS_MPI_CHK( mbedtls_mpi_read_string( &E, 16,
    	"499d46cf5152d0882d560ec67272a128" \
    	"c7507145043a4ae33a63e7406971528b" \
    	"8d14f341f08f42ffd4010658ff012353" \
    	"35b88715f9b1f0c2a35e98a89d70b03d" \
    	"3ebe219bd685ff195c3e1e2e260e17d6" \
    	"bf336a12fbc2a44678edc66e2c64bff9" \
    	"c654f73ee9a9c38e6137dcf509c1f7f8" \
    	"f9c0b12dc84d342fc1cc96fe6a3921ab" ) );

    mbedtls_mpi_exp_mod( &M, &M, &E, &N, NULL);

    if (memcmp(M.p, Expected1024, DATA_LENGTH_1024 * 4) == 0) {
	    if(verbose)
            mbedtls_printf( "Pass ^_^ \n" );
    } else {
        if(verbose){
            mbedtls_printf( "Fail\n" );
            MPI_PRINT(1, "M: ", &M);
        }
		ret ++;
    }

cleanup:

    mbedtls_mpi_free( &M );
    mbedtls_mpi_free( &E );
    mbedtls_mpi_free( &N );

    return ret;
}
#endif //CONFIG_HW_SECURITY_ENGINE
#endif /* MBEDTLS_SELF_TEST */

#endif /* MBEDTLS_BIGNUM_C */
